{
  "myself" : [
    {
      "kind" : "manifesto",
      "title" : "Designer & Developer",
      "subtitle" : "I’m the developer that makes you <strike>hesitate</strike>. The designer that makes you <strike>wonder</strike>. Welcome to my site. I’m Ramon. It’s nice to have you here.",
      "link" : "manifesto"
    },
    {
      "kind" : "lights",
      "title" : "Lights",
      "span" : "Role",
      "subtitle" : ". Electronics, iOS, Industrial &amp; Product Design, Backend, Web_",
      "link" : "lights"
    },
    {
      "kind" : "branding",
      "title" : "Personal Branding",
      "span" : "Role",
      "subtitle" : ". Development &amp; everything related to the design of it_",
      "link" : "branding"
    }
  ],

  "description" : [
    {
      "title" : "Name",
      "name" : "Ramon Gilabert_"
    },
    {
      "title" : "From",
      "name" : "Barcelona_"
    },
    {
      "title" : "Born",
      "name" : "071994_"
    }
  ],

  "manifesto" : {
    "text" : [
      {
        "title" : "The story",
        "description" : "Originally from a small town in rural Catalonia and after +1.5 years in Norway working as an iOS developer & Concept Designer, while graduating from Electronic Engineering, I’m up for new challenges and new stories.",
        "kind" : "story"
      },
      {
        "title" : "The manifesto",
        "description" : "When I get asked to describe the work I do, I keep on thinking. I do what makes you think. The prototype that makes you win. The design that makes you wow. Welcome to my site. I’m Ramon. It’s nice to have you here.",
        "kind" : "manifesto"
      },
      {
        "title" : "The awards",
        "description" : "Working together requires trust. Being selected among 300 developers to attend the 2015 Apple's WWDC, A top 3 student award in Electronic Engineering and the recognition as the best thesis in University guarantees that trust.",
        "kind" : "awards"
      }
    ],
    "next" : {
      "link" : "lights"
    }
  },

  "lights" : {
    "title" : "Lights",
    "headers" : [
      {
        "title" : "<strong>Name</strong>. Lights_"
      },
      {
        "title" : "<strong>Client</strong>. Thesis_"
      },
      {
        "title" : "<strong>Span</strong>. 7 months_"
      }
    ],
    "project" : "Merging Electronics with a beautifully designed product to create an easy to use solution to control an elegant 3D designed lamp_ Two servers, one iOS application and one microcontroller for the light are some of the components that were born out of this project.",
    "initialProcess": {
      "path" : "./images/details/lights/process/first.jpg"
    },
    "initial" : {
      "title" : "Wireframing",
      "text" : "The initial idea was cler. Present simplicity over a light color to show contrast with the actions the user needs to take. Go back to a tiny skeumorphic solution and try ripples and action showers."
    },
    "otherProcess": {
      "path" : "./images/details/lights/process/second.jpg"
    },
    "attempting" : {
      "title" : "Attempting",
      "text" : "Tried to keep the fun level of the app as high as possible, having in mind that everything needed an animation or a transition. Started playing with some icon families that showed consistency."
    },
    "attempts" : [
      {
        "path" : "./images/details/lights/attempt/first.jpg"
      },
      {
        "path" : "./images/details/lights/attempt/second.jpg"
      },
      {
        "path" : "./images/details/lights/attempt/third.jpg"
      }
    ],
    "solution" : {
      "title" : "Going Black",
      "text" : "After some attempts with white, beige, clear creme and even gray I thought, – Let's try a dark interface instead. The colors of the picker would have to be sharper and with a more neon style, so it wouldn't be as flat as we are used to. But that was all right. The details of the app would have more consistency and strength over a dark color."
    },
    "images" : [
      {
        "path" : "./images/details/lights/first.jpg"
      },
      {
        "path" : "./images/details/lights/second.jpg"
      },
      {
        "path" : "./images/details/lights/third.jpg"
      },
      {
        "path" : "./images/details/lights/fourth.jpg"
      },
      {
        "path" : "./images/details/lights/fifth.jpg"
      }
    ],
    "quote?" : {
      "text" : "My biggest side project to this date. I was asked to think creatively. So I went nuts. After 7 months working every afternoon after work. I delivered this award winner thesis."
    },
    "next" : {
      "link" : "branding"
    }
  },

  "branding" : {
    "title" : "Branding",
    "headers" : [
      {
        "title" : "<strong>Name</strong>. Branding_"
      },
      {
        "title" : "<strong>Client</strong>. Ramon Gilabert_"
      },
      {
        "title" : "<strong>Span</strong>. 3 months_"
      }
    ],
    "project" : "My most personal project up to this date. Working against the clock to perform the design, photography, concept, development and testing to release one of the projects that has guided me to my style like no other.",
    "initialProcess": {
      "path" : "./images/details/branding/process/first.jpg"
    },
    "initial" : {
      "title" : "R&G",
      "text" : "I started the project with the wrong mindset. Finish the logo first, then do the rest. I had some guidelines, so I started drawing. I draw over 300 different logos with shapes and combinations of my initials. None of them convinced me at all."
    },
    "otherProcess": {
      "path" : "./images/details/branding/process/second.jpg"
    },
    "attempting" : {
      "title" : "Restarting",
      "text" : "After pages and logos that didn’t go anywhere. I stopped. Centered my efforts on the resumé, business card, etc. and start using a placeholder for my logo instead. This is when I started to see the direction of the style. Afterwards, the logo would made sense in the context of the whole branding."
    },
    "attempts" : [
      {
        "path" : "./images/details/branding/attempt/first.jpg"
      },
      {
        "path" : "./images/details/branding/attempt/second.jpg"
      }
    ],
    "solution" : {
      "title" : "Glitching",
      "text" : "I remember when I told my friend: – I got it. I know the direction of this. I started watching then videos with crazy sound and glitches in the internet to get inspiration, there it was. Simple, clean and beautiful. I know I would have to create tons of different glitches to make it personal in every ocasion. I was ready. And this is the result of it."
    },
    "images" : [
      {
        "path" : "./images/details/branding/first.jpg"
      },
      {
        "path" : "./images/details/branding/second.jpg"
      },
      {
        "path" : "./images/details/branding/third.jpg"
      },
      {
        "path" : "./images/details/branding/fourth.jpg"
      }
    ],
    "quote?" : {
      "text" : "After nights working, sketches, prints papers scratched and lots of hours of watching old TVs and failing printers I found the style that now defines me. It’s been a long process, but I’m super satisfied with the result of it."
    },
    "next" : {
      "link" : "manifesto"
    }
  }
}
