{
  "myself" : {
    "page" : "Ramon Gilabert — Award Winning Designer &amp; Developer",
    "title" : "Ramon Gilabert",
    "header" : "gilabert",

    "story" : {
      "title" : "story",
      "text" : "<span class='dot'>Ramon Gilabert</span> is an award winning designer and developer from a rural town in Catalonia. Right now, he is enjoying every day in Barcelona, doing amazing products as a freelancer."
    },

    "projects" : [
      {
        "name" : "gluten",
        "image" : "images/projects/gluten/myself.png",
        "link" : "./gluten",
        "role" : "Concept, UI & UX design"
      },
      {
        "name" : "lights",
        "image" : "images/projects/lights/myself.png",
        "link" : "./lights",
        "role" : "Concept, UI & UX design"
      },
      {
        "name" : "revolution",
        "image" : "images/projects/revolution/myself.png",
        "link" : "./revolution",
        "role" : "Concept, Design, Development, Electronics"
      }
    ],

    "recognition" : {
      "title" : "others",
      "others" : [
        {
          "text" : "A video about design every week at <a href='https://www.sketchcasts.net' target='_blank'><span class='dot'>SketchCasts</span>.</a>"
        },
        {
          "text" : "<a href='http://puzzles.design' target='_blank'><span class='dot'>Puzzles</span></a> iOS 10 UI kit."
        },
        {
          "text" : "I <span class='dot'>retouch</span> images for fun."
        }
      ],

      "awards" : [
        {
          "title" : "awards 2016",
          "list" : [
            {
              "highlight" : "Honorable Mention",
              "rest" : "from the Awwwards jury."
            },
            {
              "highlight" : "Special Kudos",
              "rest" : "from CSS Design Awards."
            },
            {
              "highlight" : "Site of the Day",
              "rest" : "from CSS Awards."
            },
            {
              "highlight" : "Star of the Day",
              "rest" : "from CSS Winner."
            },
            {
              "highlight" : "Thesis with honors",
              "rest" : "from University of Lleida."
            },
            {
              "highlight" : "Top 3 alumni",
              "rest" : "2012-2016 University of Lleida."
            }
          ]
        },
        {
          "title" : "awards 2015",
          "list" : [
            {
              "highlight" : "Apple WWDC scholarship",
              "rest" : "recognition."
            }
          ]
        }
      ]
    }
  },

  "gluten" : {
    "page" : "Ramon Gilabert — Award Winning Designer &amp; Developer",
    "title" : "Ramon Gilabert — Lights",
    "name" : "gluten",
    "role" : "Concept, UI & UX design",
    "summarize" : {
      "paragraph" : [
        {
          "text" : "A project created out of a pure necessity to help celiacs around the world, like myself, with their disease. <span class='dot'>Gluten</span> is based in the experience of celiacs like my sister and I, who have been suffering problems related to that disorder in their day to day life."
        }
      ],

      "image" : {
        "link" : "images/projects/gluten/summarize.jpg",
        "quote" : "Featuring the final result of the product with the scanner, the statistics and the mood screens."
      }
    },

    "story" : {
      "title" : "story",
      "paragraph" : [
        {
          "text" : "<span class='dot'>Gluten</span> is my most personal project yet, the representation of a disease I've had for the last 10 years of my life. The personal knowledge acquired after having to read ingredients from all the products in a supermarket without any help in the labeling, or the difficulty to find food in a restaurant's menu. After asking different people that were facing the same problem, the idea of this product was born."
        },
        {
          "text" : "Although the knowledge of what gluten is, or what gluten causes has increased in the last few years in the general population, there's still a lot of unknown. <span class='dot'>Gluten</span> needed to solve three main issues every celiac faces — scan products and get the gluten concentration, track what has been eaten during the day, presenting the statistics in an understandable way, and a finder of services that offered gluten free options."
        }
      ],
      "image" : {
        "link" : "images/projects/gluten/story.jpg",
        "quote" : "Featuring the finding of services around and a happy reaction during dinner."
      }
    },

    "solution" : {
      "title" : "solution",
      "paragraph" : [
        {
          "text" : "There was a lot of concept work for <span class='dot'>Gluten</span>. The decision to design an app instead of a website was accessibility. The app needed to do three things the best and easiest way possible. As mentioned above, those three solutions were a services map, a scanner and a mood tracker with statistics. In the concept phase it was discarted to do more than one app because the features were small and compact enough."
        },
        {
          "text" : "Inside the app, it was decided to use a hamburger menu instead of a tab bar — the main reasoning for that being the fact that each feature was separate enough for it to contain its own private space, as well as no need to combine more than one when using them. It was shown after some surveys that the users would use the app in periods and for a concrete action, either find a service, or scan a product, or register your mood."
        },
        {
          "text" : "The guidelines in style of the app were yet to be defined. It was clear that it would feature an accessible design, but basic things like which was the first screen or which color the user would understand better still remained unknown."
        }
      ],
      "image" : {
        "link" : "images/projects/gluten/image.jpg",
        "quote" : "One of the first sketches I did to kick off the project."
      }
    },

    "flow" : {
      "title" : "user flow",
      "paragraph" : [
        {
          "text" : "This step began to form the flow of the app, and with the clear intention of using a hamburguer menu, the separation of screens was clear from the beginning."
        },
        {
          "text" : "With this in mind, it was decided that the first screen the user would see when entering the app after the first onboarding and registration was the <span class='dot'>mood selection</span> and <span class='dot'>statistics</span>. From there, said user would have access to the main menu and to register and see mood. The reasoning behing this was the usage factor. The probability of:"
        },
        {
          "text" : "• The user finding a service around was at most 3 a day.",
          "class" : "spacing indent"
        },
        {
          "text" : "• The user registering her mood was at most 5 a day.",
          "class" : "spacing indent"
        },
        {
          "text" : "• The user scanning a product could be at any time.",
          "class" : "indent"
        },
        {
          "text" : "The fluctuation of the “any time” case marked certain uncertanty, but after computing the values over the course of a month, a steady 5 times a day beated the scanning value which would vary between 3 - 9 a day. It’s obvious that the app would register the last screen seen and save the position of the user, as well as some patrons on hours of the day to check which screen the user should be in. Tuesday after dinner would make sense to be in the mood screen more than in the finding a service one."
        },
        {
          "text" : "Needs to be said that a login will be required for the user after the onboarding, just with a name, an optional gender and a password to prevent any sensible data to be stolen or seen by someone else. That, will also allow upcoming features like reviews or login from the <span class='dot'>Gluten</span> website to add a mood or display statistics to be easier to implement."
        }
      ],
      "image" : {
        "link" : "images/projects/gluten/flow.jpg",
        "quote" : "A small extraction of the user flow when entering the app, with different possibilities."
      }
    },

    "mood" : {
      "title" : "mood selection",
      "paragraph" : [
        {
          "text" : "The mood and statistics section needed to be clear and easy to use. Just 3 steps — selecting how the user was feeling, what she ate, and some additional information like notes, fatigue, allergic reaction or possible medication taken during the entered period. This was a crucial step in terms of easiness — having to input every meal was a thing that would be difficult if the screen was messy in terms of design and usability, for that, a big font was selected, as well as some graphics to choose an easy representation of the mood."
        },
        {
          "text" : "Related to that, the statistics section also needed to be as clean as possible for the user to see a clear overview and information of every selected day. That would help export the information for the user's dietitian as well as give a clear vision on how the diet was being made. For that, it contained a graph that would allow users to select the day in which the interest resided, and inside every day, there would be an overview of every input meal — morning, lunch, dinner as the main key points."
        },
        {
          "text" : "As a side point, the reason to use faces within the statistics section of the mood selection was to give a more personal feel to the app, since this would be something you would have to see every single day. Such part, would be asked in the onboarding and could be changed in the settings page, being able to leave it blank for other illustrations to appear."
        }
      ],
      "image" : {
        "link" : "images/projects/gluten/mood.jpg"
      }
    },

    "scanner" : {
      "title" : "scanner",
      "paragraph" : [
        {
          "text" : "Starting with the scanner, it was clear that it had to contain the concentration of gluten of the product, with some additional information to it — the risk of gluten in the factory the product was made and the calories were some examples of it. The features in this section could of course grow, but there was no need for now to include them, as this is the basic question a celiac faces when wondering about a specific product."
        },
        {
          "text" : "The scanner had to contain the already scanned products, showing an icon for each one of them. This icon would exist in a database with all the information given with it. Finally, the scanner's camera would work automatically, without the need of the user to press any button at all."
        }
      ],
      "image" : {
        "link" : "images/projects/gluten/scanner.jpg"
      }
    },

    "services" : {
      "title" : "services",
      "paragraph" : [
        {
          "text" : "Jumping to the services, it was easy to conceptualize a map with all the information of the service you were looking for. It was important to present, in an intuitive manner,  and directly in the map, which service was around — a bakery, pizzeria, cake shop or a burger place are some of the examples."
        },
        {
          "text" : "When selecting one of the restaurants, the app would present more actions like the possibility to call, save the service or get directions there, as well as some additional information like product specialities."
        },
        {
          "text" : "Because there isn't a database with all the necessary information yet, the icons can be created when adding a restaurant or a product into it. Part of the challenge of creating this product resides basically in the lack of information in the field — and so does the disease."
        }
      ],
      "image" : {
        "link" : "images/projects/gluten/services.jpg"
      }
    },

    "landing" : {
      "title" : "landing page",
      "paragraph" : [
        {
          "text" : "In terms of visual design, the last piece was the landing page which would tell the user to download the app by showing the main benefits of it."
        },
        {
          "text" : "The main goal was that it had to be fun enough for the user to remember — however, because the value of the app was big enough for the user to download it right away, the importance was to show some of its screenshots to present the potential of the product."
        }
      ],
      "image" : {
        "link" : "images/projects/gluten/landing.jpg"
      }
    },

    "visually" : {
      "title" : "visually",
      "paragraph" : [
        {
          "text" : "The first flow to be prototyped was the scanner, it featured a white text over dark palette. After some user research, people started to ask why the dark color, questioning if it would make easier and clearer to understand the overall app and information. After some consideration and tests with middle dark palettes and clear ones, the users preferred a white theme with sharp text over it."
        },
        {
          "text" : "Another thing that visually changed was the font, being at first smaller and presenting more information in the screens. User research made the app more simplistic and straight to the point."
        }
      ],
      "colors" : [
        {
          "code" : "#6BCDFF",
          "class" : "four"
        },
        {
          "code" : "#A9F2FF",
          "class" : "four"
        },
        {
          "code" : "#FF9538",
          "class" : "four"
        },
        {
          "code" : "#FCFEFF",
          "class" : "four",
          "position" : "last"
        }
      ]
    },

    "finally" : {
      "title" : "gluten",
      "paragraph" : [
        {
          "text" : "<span class='dot'>Gluten</span> is my most personal project. A project that represents who I am and what I have been for the past 10 years. It's the ultimate solution to years of challenges I've faced with this disease. Hopefully now, with this solution, thousands of people will be able to tell right away how they are or what they eat, and feel better with themselves. Calling a product what cannot be eaten might seemcontroversial, but this is the only gluten a celiac can take."
        }
      ]
    },

    "next" : {
      "title" : "what's next",
      "path" : {
        "class" : "space"
      },
      "paragraph" : [
        {
          "text" : "<span class='dot'>Gluten</span> is a project that’s been in the making for 8 years. As mentioned above, this set of features marks the MVP for a product that needs much iteration on. From adding many products and services into a growing database, to give users voice to rate their own experiences."
        },
        {
          "text" : "<span class='dot'>Gluten</span> is a project that will start development as soon as I hit the United States. With that, many details will start to appear, and the challenge will be to iterate over that.",
          "class" : "paragraph-space"
        }
      ]
    },

    "toolkit" : {
      "title" : "toolkit",
      "path" : {
        "class" : "space"
      },
      "paragraph" : [
        {
          "text" : "<a href='https://shop.dribbble.com/products/gameplan-journal?variant=1006322845' target='_blank'>Pen and paper</a> for the concept.",
          "class" : "spacing"
        },
        {
          "text" : "<a href='https://sketchapp.com' target='_blank'>Sketch</a> for the app.",
          "class" : "spacing"
        },
        {
          "text" : "<a href='http://www.adobe.com/products/photoshop.html' target='_blank'>Photoshop</a> for the site.",
          "class" : "spacing"
        },
        {
          "text" : "<a href='http://principleformac.com' target='_blank'>Principle</a> for early prototypes."
        }
      ]
    },

    "back" : {
      "title" : "revolution",
      "link" : "./revolution"
    },

    "forward" : {
      "title" : "lights",
      "link" : "./lights"
    }
  },

  "lights" : {
    "page" : "Ramon Gilabert — Award Winning Designer &amp; Developer",
    "title" : "Ramon Gilabert — Lights",
    "name" : "lights",
    "role" : "Concept, UI & UX, Industrial, Electronic Design & Development",
    "summarize" : {
      "paragraph" : [
        {
          "text" : "<span class='dot'>Lights</span>, the union between the knowledge acquired during my electronic engineering degree, my software development skills and my passion for design. A product that let users control a smart light from anywhere in the world. Raspberry Pi, Arduino, industrial design, iOS development and product design had a major role in the process of the making of this product."
        }
      ],

      "image" : {
        "link" : "images/projects/lights/summarize.jpg",
        "quote" : "The two most important screens in Lights, the starting one and the editing one."
      }
    },

    "story" : {
      "title" : "story",
      "paragraph" : [
        {
          "text" : "Right when my electronic engineering degree was getting to an end, I got asked to do a thesis. I could’ve studied waves of signals, but I wanted to do something more creative. Put together all the knowledge of design and development I had and create a product, from the beginning to the end. From the concept to the manufacturing."
        },
        {
          "text" : "Diving into some specifics, I decided to do an internet of things object, and, because a light was the most visual of them all, I decided to do a light. There had to be a lot of concept involved, and, because an object of the internet of things is so vague, I would have to constrain the project in a way that was appealing, but not trying to do too much. That’s how <span class='dot'>Lights</span> was born. One of my favorite projects I’ve done, and probably the one I know the most of. Every detail is thought and discussed to a remarkable point."
        }
      ],
      "image" : {
        "link" : "images/projects/lights/story.jpg",
        "quote" : "The paired screen, the one displayed after the searching for a light was done and it was ready to use."
      }
    },

    "solution" : {
      "title" : "solution",
      "paragraph" : [
        {
          "text" : "There’s a lot involved into <span class='dot'>Lights</span>. So let’s start by breaking up what was done within the project."
        },
        {
          "text" : "• The product needed servers to interact to each other and register lights.",
          "class" : "spacing indent"
        },
        {
          "text" : "• The product also needed a light and a hub to contain different lamps for each user.",
          "class" : "spacing indent"
        },
        {
          "text" : "• The product needed an app to let the user control the light.",
          "class" : "spacing indent"
        },
        {
          "text" : "• The product needed to be super simple and good enough for a normal person to use it.",
          "class" : "spacing indent"
        },
        {
          "text" : "• The app needed to be understandable enough for a user to not get lost in it.",
          "class" : "spacing indent"
        },
        {
          "text" : "• The setup of the whole product would be as simple as connecting a light and a hub.",
          "class" : "indent"
        },
        {
          "text" : "The most obvious way to start laying out the concept, and the biggest problem I had at first was an infrostructure problem. I knew that the app would need bluetooth to connect to the app, I wasn’t sure how to solve that, but I could find a way, I knew I could design and easy to use solution and I had in mind how the lamp had to be, since I wanted to give an industrial look into it. However, there was the server problem. How is a server going to contain all the information of all the lights? How many servers do we need?"
        },
        {
          "text" : "I started to sketch different solutions, and the one that made the most sense was clear, there will be two servers, one central one in the cloud and one at your home called hub, the two servers will interact with each other and will be the gate to any modification to the light via your phone through the app or via a website client. The light, will also automatically reach such hub and will listen to commands from it."
        }
      ],
      "image" : {
        "link" : "images/projects/lights/image.jpg",
        "quote" : "An early image from the process of conceptualizing how the whole product should be."
      }
    },

    "server" : {
      "title" : "server problems",
      "paragraph" : [
        {
          "text" : "There’s a lot of problems that evolve from having servers talk to each other. It was obvious that the user needed a light at home, one, or several. So it was pretty obvious that there would have to be some kind of hub that a phone would talk to, and give instructions. However, how would a phone talk to that hub? If the user was around such hub, a technology like Bluetooth could’ve been used, however, because one of the premises of the project was to be able to control the light from anywhere in the world, we would have to talk to it through the internet."
        },
        {
          "text" : "There would have to be some kind of cloud that would contain all the lights, so the phone could download and manipulate them. However, the main problem that raised was, how is the cloud going to talk to the hub itself? The main option was an HTTP request with a REST API, however, digging more into it, because it was sort of an unknown problem, I discovered that HTTP requests only work one way. A service asks for information, a server gives it back. The server cannot ask for something in the service. If we think about it, we would need that. A server in the cloud would hand information to the phone, but that server, would also have to send a message to the other server at home after the light was manipulated."
        },
        {
          "text" : "Another problem was the port connection. In order for HTTP to work over your home, you need to have a port open, and that destroys the premise of having an easy to use, just plug it in, solution. After some investigation, I discovered that Web Sockets was the fastest way to go. A two way communication, that sort of violates the laws of HTTP to create a connection between devices."
        }
      ],
      "image" : {
        "link" : "images/projects/lights/server.jpg",
        "quote" : "Communications and infroestructure of the platform."
      }
    },

    "plugged" : {
      "title" : "plugged in",
      "paragraph" : [
        {
          "text" : "In order to fix the server hassel, sockets were used, so the user wouldn’t have to open any port in the router or anything like that. The main selling point of the product was to connect and use. How would we achieve that with one server at home and one server in the cloud? How would they talk to each other?"
        },
        {
          "text" : "The system I used in order to fix this problem was an awakening solution. The first time the user would plug in the hub, such device would send a message to a given address — the cloud server — asking to register itself in the database. The hub then, would save itself, save a secret key to give security in the editing of the light later on and start looking for lights and phones to pair itself with them."
        },
        {
          "text" : "Each light, once connected, would do a similar process, they would ask the hub to register them, and once that was done,  the hub would send a message to the cloud server with the light. The app would work in a similar way explained a bit below."
        },
        {
          "text" : "It was that easy, and from pretty early on, the concept to keep it like that existed. I had no idea how to fix it at first, but after the sockets discovery, everything seemed pretty straight forward. Lots of Bluetooth dongles and even a specific shield to give the Arduino wireless capabilities had to be bought."
        }
      ],
      "image" : {
        "link" : "images/projects/lights/plugged.jpg",
        "quote" : "Abstraction of the process of connecting the hub. Each step is thoughtfully placed after the other to have everything ready for the user."
      }
    },

    "industrial" : {
      "title" : "industrial design",
      "paragraph" : [
        {
          "text" : "It was the first time I was doing 3D design, as well as it was the first time doing a server but, in both cases, after a lot of concept work in a whiteboard, I had a pretty clear idea of what I wanted before starting of."
        },
        {
          "text" : "For the industrial design, I wanted an app that had a trendy industrial look, for everyone to use and everyone to have, and not just the techy person. I wanted everyone to be able to use it by just connecting it, so a part from simple, had to be beautiful."
        },
        {
          "text" : "The hub would follow the dark style of the app, with a squared box of the size of a Raspberry Pi. The light itself, had an industrial look with materials like aluminium and real glass instead of plastic."
        }
      ],
      "image" : {
        "link" : "images/projects/lights/industrial.jpg",
        "quote" : "Detail of the lamp from the back, featuring an analog button for all use cases and four screws to fix the position."
      }
    },

    "pairing" : {
      "title" : "light pairing",
      "paragraph" : [
        {
          "text" : "We’ve explained the system that the hardware was using to talk to each other — but how would the app fit within this process? It was simple, it had to pair the device with the hub, and after getting all the lights and the secret token, it could start editing them."
        },
        {
          "text" : "In order to do that, the app would advertise itself once open and after the user hit the start button of the main screen, a searching would start and, after the hub would find the phone, the information would be sent."
        },
        {
          "text" : "To have all the lights in the app, it would download them from the internet to have the latest values and, when that was done, the user could start editing them."
        }
      ],
      "image" : {
        "link" : "images/projects/lights/pairing.jpg"
      }
    },

    "editing" : {
      "title" : "light editing",
      "paragraph" : [
        {
          "text" : "Three main values had to be edited in this screen. The status of the light — ON or OFF — the intensity of the bulb, and the color of it. The first solution that came to mind was to do a different set of slides, however, this wasn’t creative enough even though intuitive."
        },
        {
          "text" : "Not being creative enough could cause the app to feel so simple and, also, the fact of putting 4 slides to edit the colors and intensity wasn’t that good of an idea. The next iteration, then, contained a color wheel with a side bar to change intensity."
        },
        {
          "text" : "It wasn’t until there was some user test that I discovered how the people were trying to use the app. They wanted something that could edit both at the same time, so I created a wheel that would edit the intensity when changing the radius and would obviously change the color with the color of the RGB wheel. For the status, a simple button would do the job."
        }
      ],
      "image" : {
        "link" : "images/projects/lights/editing.jpg"
      }
    },

    "visually" : {
      "title" : "visually",
      "paragraph" : [
        {
          "text" : "Switching to the part of the product that would be the gate to the user to the digital world, the app had to give trust while being as simple to use as the analog product. For that, the starting point was a light style and, however a lot of interesting concepts came out of that — like big buttons with lots of steps that animated to each other and so on, a dark theme took over. The reason for that being mainly the editing of the color and intensity of the light. I wanted the colors to pop more. Some feedback gathered in interviews presented the same."
        },
        {
          "text" : "Other than that, the app featured a lot of small steps in different screens, with floating style animations that would make the process of waiting and pairing the light way easier to deal with. Big text in buttons would make the actions way clearer and the font combination would also present a compact style."
        }
      ],
      "colors" : [
        {
          "code" : "#131313"
        },
        {
          "code" : "#373C3F"
        },
        {
          "code" : "#FFFFFF",
          "position" : "last"
        }
      ]
    },

    "finally" : {
      "title" : "lights",
      "paragraph" : [
        {
          "text" : "<span class='dot'>Lights</span> was a challenge from the beginning to the end. Hundreds of hours trying to figure out every small detail and interaction the user would have with the product, and the product would have to itself. I am really happy and proud of the result in the industrial, concept, UI & UX design, as well as the development of it. I had never done a server before, and I did two, I had never done 3D in Cheetah, and I did two products with it, I had never thought about that much scalability, and that was the first one. <span class='dot'>Lights</span> is the project of firsts, to close up one period of my life — my degree."
        }
      ]
    },

    "next" : {
      "title" : "what's next",
      "path" : {
        "class" : "space"
      },
      "paragraph" : [
        {
          "text" : "After presenting it to an award and having one one for the best thesis of the year, the next step for <span class='dot'>Lights</span> as a project is to start it over. Not as in, remove and restart — the base is really good. What I want to say is that the current state of <span class='dot'>Lights</span> represents what can be done in the internet of things, and the infraestructure created for this project could be ported to any kind of device. A thermostat, a window, a table, a chair. That’s the next step for this project, evaluate what can be done, see what’s next with it."
        },
        {
          "text" : "A couple of people from <span class='dot'>Catalonia</span> and <span class='dot'>Norway</span> proposed to do a Kickstarter campaign, which might be also an option.",
          "class" : "paragraph-space"
        }
      ]
    },

    "toolkit" : {
      "title" : "toolkit",
      "path" : {
        "class" : "space"
      },
      "paragraph" : [
        {
          "text" : "<a href='https://shop.dribbble.com/products/gameplan-journal?variant=1006322845' target='_blank'>Pen and paper</a> for the concept.",
          "class" : "spacing"
        },
        {
          "text" : "<a href='https://sketchapp.com' target='_blank'>Sketch</a> for the app.",
          "class" : "spacing"
        },
        {
          "text" : "<a href='http://www.cheetah3d.com' target='_blank'>Cheetah3D</a> for the industrial design.",
          "class" : "spacing"
        },
        {
          "text" : "<a href='https://atom.io' target='_blank'>Atom</a> to develop the servers.",
          "class" : "spacing"
        },
        {
          "text" : "A <a href='https://www.raspberrypi.org' target='_blank'>Respberry Pi</a> and an <a href='https://www.arduino.cc' target='_blank'>Arduino</a>",
          "class" : "spacing"
        },
        {
          "text" : "Tens of wires and electronic components."
        }
      ]
    },

    "back" : {
      "title" : "gluten",
      "link" : "./gluten"
    },

    "forward" : {
      "title" : "revolution",
      "link" : "./revolution"
    }
  },

  "revolution" : {
    "page" : "Ramon Gilabert — Award Winning Designer &amp; Developer",
    "title" : "Ramon Gilabert — Revolution",
    "name" : "revolution",
    "role" : "Concept, UI & UX Design",
    "summarize" : {
      "paragraph" : [
        {
          "text" : "Thousands of people move to new cities every day, millions love sports. With so much events going under the radar every day, <span class='dot'>Revolution</span> plans to solve that issue, presenting sports and gatherings around activties to users around the planet. You join an event, the rest is having fun playing it."
        }
      ],

      "image" : {
        "link" : "images/projects/revolution/summarize.jpg",
        "quote" : "Bright over dark, the theme that followed after successfull user research. With different color combinations for the user to choose."
      }
    },

    "story" : {
      "title" : "story",
      "paragraph" : [
        {
          "text" : "<span class='dot'>Revolution</span> is a project born out of necessity. Being new to a city it’s never an easy task. Knowing nobody to play sports, not knowing where events are happening. Every field has its own system to gather people together. Meetup for meetings, Eventbrite for conferences, Facebook for everything else. However, when you are not connected to that people that organize events in Facebook, or you are not quite a fan of this solution for it’s inmensity in that field, you are lost in the sea of doubt."
        },
        {
          "text" : "The main goal for <span class='dot'>Revolution</span> is to allow its users to find people that want to play the same sport as you do. Those people create an event, and you can just sign up for it. Before the game, you can start connecting within an open chat. A gathering social revolution."
        }
      ],
      "image" : {
        "link" : "images/projects/revolution/story.jpg",
        "quote" : "Here goes an image of the project as is now, with a quote in it."
      }
    },

    "solution" : {
      "title" : "solution",
      "paragraph" : [
        {
          "text" : "At first, the goal seems pretty big — an app to solve social sports gathering. But if you think about it, this is a necessity thousands of people face. Within a world where people have more and more difficulties interacting to each other, it’s hard to design something that solves that problem while still giving enough confidence to its users to use it. There’s so many unknowns:"
        },
        {
          "text" : "• Will the group connect in the game? Will they be able to get along?",
          "class" : "spacing indent"
        },
        {
          "text" : "• Who is able to create sports? How to do it? How to make it appealing?",
          "class" : "indent"
        },
        {
          "text" : "In order to answer that, the design was focused in confidence, while giving a sportsy look into the app. The concept was to allow big curators of events, such as Nike, Adidas or Puma to be able to create its own competitions within the app, as well as soccer games created by professionals, or even basketball tournements in a random pitch in town."
        },
        {
          "text" : "With all that in mind, the MVP of this product needed to be simple and clear enough for users to trust it, and big corporations to engage with it. The product would feature two main branches at first. One to find a sport and sign up for it, and the other to track your performance. The event creation branch, is being built at the moment. And would be done after the release of the first MVP featuring big names in the sport community."
        },
        {
          "text" : "The design would also include a very image heavy solution for the landing page, in order to make the potential user feel the power that athletes transmit through the pictures."
        }
      ],
      "image" : {
        "link" : "images/projects/revolution/image.jpg",
        "quote" : "The starting point of revolution, what started it all."
      }
    },

    "flow" : {
      "title" : "user flow",
      "paragraph" : [
        {
          "text" : "As stated above, the app would have two main parts. One to join events, an another to track the user’s performance in such events. The union between them would be obvious. At first, and after the onboarding, the user would be directed to find a sport — that’s because it’s the first time in the app and there’s nothing to track yet. From there, if there’s sports tracked already, the user would be redirected to the statistics and tracking section."
        },
        {
          "text" : "The decision to use a hamburguer menu was basically for the lack of connection between the features in an easy step. If the user is searching sports, she is not tracking her activity, and viceversa. That being said, it’s obvious that, if such user joins an event and wants to track it right away, the app would know that, and would redirect her to the other screen in order for the tracking to begin."
        },
        {
          "text" : "Other than that, the flow would be really simple. There would be three steps to select a sport and just one to start tracking. Finally, in order to save future events, there would be a small section in the app that would allow you to find each event, the chat, and a button to start tracking."
        },
        {
          "text" : "Needs to be added that, in the sport selection, an additional flow passed my mind during the concept phase. What to do first was the question, a map, or a list with a sports? Because the app needed to provide lots of results, and the job of the product would be to have available as many events as possible, it wouldn’t be a good solution to constrain the user to a certain location at first. The app would obviously look at events at the user’s city and provide a list, after the user would select the sport she wanted to play, she would get presented with the map. During concept, the feeling was that if you present a user with a map at the beginning, you are constraining what they opened the app for. That’s why the constrains appear at the end rather than at the beginning."
        }
      ],
      "image" : {
        "link" : "images/projects/revolution/flow.jpg",
        "quote" : "Abstraction of one of the flows of the app, showing how a user would join a sport."
      }
    },

    "find" : {
      "title" : "find sports",
      "paragraph" : [
        {
          "text" : "There’s some things that we need to keep in mind in order to find the sport and the event you are looking for."
        },
        {
          "text" : "• Which sport does the user want to play?",
          "class" : "spacing indent"
        },
        {
          "text" : "• Where does the user want to play?",
          "class" : "spacing indent"
        },
        {
          "text" : "• How does the user join a sport?",
          "class" : "spacing indent"
        },
        {
          "text" : "• Where do all those sports get saved?",
          "class" : "indent"
        },
        {
          "text" : "Those were the questions that the app needed to solve in the <span class='dot'>find your sports</span> section. For that, the solution included a step by step selection — to make it less crowded in the screen. With that in mind, three steps were create. One to select your sport, a map or list to select the location, and a joint screen to see all your events. In terms of selecting a sport, it needed to be intuitive for the user, and also, needed to include as much sports as possible for any need that a user would have. A simple map with an option of having a list ordered by distance, would be easy enough for the user to start an event."
        }
      ],
      "image" : {
        "link" : "images/projects/revolution/find.jpg"
      }
    },

    "tracking" : {
      "title" : "tracking",
      "paragraph" : [
        {
          "text" : "As stated above, the app would know when to show the tracker to the user. Either when a sport was about to start, or when there was tracking information already in place. The tracking of a user would consist of a two screen process. In the called <span class='dot'>feed</span>, the user would see all the past tracked results, with information like calories burned, BPM mean or time. It would also see a graphic of the intensity based over time for that specific workout."
        },
        {
          "text" : "By selecting an active tracking, the user would see the amount of miles she had done during that workout, and some additional information like the one stated above. The user would be able to track different events, or just start a new tracking from the feed. Even though there’s a lot of different sports, the tracking would be as simple as pressing a button for now, adding specific features for each one of them later on. "
        }
      ],
      "image" : {
        "link" : "images/projects/revolution/tracking.jpg"
      }
    },

    "others" : {
      "title" : "others",
      "paragraph" : [
        {
          "text" : "I wanted to highlight some other screens that were designed for the app. The menu would follow the overall style making an animation coming from the top. The chat would be as simple as showing bubbles of the users, and the sports collective with future events would follow the tracking feed."
        },
        {
          "text" : "As stated above, the event creation would be done right now by admins, but would be outsourced to people as soon as users got engadged with the product. It would have to also be really simple. Select a sport, a venue and a number of people to join."
        }
      ],
      "image" : {
        "link" : "images/projects/revolution/others.jpg"
      }
    },

    "landing" : {
      "title" : "landing page",
      "paragraph" : [
        {
          "text" : "In terms of visual design, the last piece was the landing page which would tell the user to download the app by showing the main benefits of it. The website needed to be clear and straight to the point, marketing the app as the main concept, and showing the three basic steps to join an event. With that, different images were retouched to give the viewer a feel of power. The darkness of the site, was justified with the idea of giving the athletes and text the most importance."
        },
        {
          "text" : "The images were personally retouched with some blemish removal and some lighting fixing, as well as different background creation and so on. Each image counted with more than 25 layers on top of the original one to give it the same feel."
        }
      ],
      "image" : {
        "link" : "images/projects/revolution/landing.jpg"
      }
    },

    "visually" : {
      "title" : "visually",
      "paragraph" : [
        {
          "text" : "Visually the first colors that came to mind were dark ones combined with an electric contrast color. Lots of them were tried — green, blue, pink, orange or red, and the one that the users liked the most, in terms of usage was the orange one. Because orange is associated to shine, and the contrast with a dark gray makes it pop a lot, the users preferred to a more conventional solution like green or blue. However, though, because there was some uncertainty at the beginning within the same user research, this could present a opportunity to make themes around the app."
        },
        {
          "text" : "Other than that, it might seem weird the decision to make the app less image heavy as the website is, but I personally wanted to keep it as simple as possible, featuring just the information that needed to be given with the maximum negative space possible — giving clarity to the end user and at the same time trust."
        }
      ],
      "colors" : [
        {
          "code" : "#1D181D"
        },
        {
          "code" : "#FF5C42"
        },
        {
          "code" : "#FFFFFF",
          "position" : "last"
        }
      ]
    },

    "finally" : {
      "title" : "revolution",
      "paragraph" : [
        {
          "text" : "The name <span class='dot'>Revolution</span> is born out of the idea of creating a new step forward in the sports world, making it as easy as it can be to join any event, in any city in the world, with a self driven community."
        }
      ]
    },

    "next" : {
      "title" : "what's next",
      "path" : {
        "class" : "space"
      },
      "paragraph" : [
        {
          "text" : "<span class='dot'>Revolution</span> comes from a personal need when being new to a city — and after scratching the surface of what it can be done with this concept, it’s easy to see more things getting attached to this main idea. A sports creation section is basic, and a continuous improvement over the main columns of the app is something that must be done."
        },
        {
          "text" : "The development of this app will happen at some point, after <span class='dot'>Gluten</span> is released.",
          "class" : "paragraph-space"
        }
      ]
    },

    "toolkit" : {
      "title" : "toolkit",
      "path" : {
        "class" : "space"
      },
      "paragraph" : [
        {
          "text" : "<a href='https://shop.dribbble.com/products/gameplan-journal?variant=1006322845' target='_blank'>Pen and paper</a> for the concept.",
          "class" : "spacing"
        },
        {
          "text" : "<a href='http://www.adobe.com/products/experience-design.html' target='_blank'>Adobe XD</a> for the app.",
          "class" : "spacing"
        },
        {
          "text" : "<a href='http://www.adobe.com/products/photoshop.html' target='_blank'>Photoshop</a> for the landing and the retouch.",
          "class" : "spacing"
        },
        {
          "text" : "<a href='http://principleformac.com' target='_blank'>Principle</a> for the early prototypes.",
          "class" : "spacing"
        }
      ]
    },

    "back" : {
      "title" : "lights",
      "link" : "./lights"
    },

    "forward" : {
      "title" : "gluten",
      "link" : "./gluten"
    }
  },

  "social" : [
    {
      "image" : "images/general/social/twitter.svg",
      "link" : "https://www.twitter.com/RamonGilabert"
    },
    {
      "image" : "images/general/social/dribbble.svg",
      "link" : "https://www.dribbble.com/RamonGilabert"
    },
    {
      "image" : "images/general/social/github.svg",
      "link" : "https://www.github.com/RamonGilabert"
    },
    {
      "image" : "images/general/social/linkedin.svg",
      "link" : "https://www.linkedin.com/in/RamonGilabert"
    }
  ]
}
